{
    "basics": {
        "name": "Antonio Marasescu-Duran",
        "label": "Senior Software Engineer",
        "image": "https:avatars.githubusercontent.com/u/52678433?v=4",
        "email": "antonio.marasescuduran@gmail.com",
        "phone": "+40744968443",
        "url": "https://www.antoniomarasescuduran.com/",
        "summary": "Hello! I am Antonio, an IT enthusiast which works full-time as a Full-Stack Software Engineer, often taking on the responsibilities of a lead developer. This includes managing DevOps and sometimes overseeing a project architecture. I have expertise in web development, particularly with Angular and React, while on the backend, I typically use Node.js and Spring. In terms of cloud computing, my expertise lies in utilizing AWS, CDK, and Terraform.",
        "location": {
            "address": "",
            "postalCode": "",
            "city": "Cluj-Napoca",
            "countryCode": "RO",
            "region": "Cluj"
        },
        "profiles": [
            {
                "network": "Github",
                "username": "antonio-marasescu",
                "url": "https://github.com/antonio-marasescu"
            }
        ]
    },
    "work": [
        {
            "name": "MSG Systems Romania",
            "position": "Senior Software Engineer",
            "url": "https://www.msg-systems.ro/",
            "startDate": "2022-03-18",
            "endDate": "2024-03-20",
            "summary": "At present, I am leading a team focused on the development and integration of Large Language Model (LLM) solutions into an Objective and Key Results (OKR) management application, leveraging a completely serverless architecture. I bear the primary responsibility for the architectural design and research on various subjects, as well as managing the AWS cloud infrastructure using the CDK.",
            "highlights": [
                "I am spearheading the creation of an internal component library for the company, designed to enhance brand consistency and facilitate reusability across its internal projects.",
                "Worked on developing a platform that Babeș-Bolyai University aims to showcase its projects that involve citizens in a comprehensive and accessible manner. My role involved full-stack development duties, with a focus on refining and improving challenging aspects of the application, including functionality, JPA query optimization, and enhancing overall code cleanliness and quality.",
                "Worked on a responsive processing application for leads in sales management which needed to handle large amount of external imported data through excel, being the main frontend developer and contributing to the AWS architecture."
            ]
        },
        {
            "name": "MSG Systems Romania",
            "position": "Software Engineer",
            "url": "https://www.msg-systems.ro/",
            "startDate": "2020-03-20",
            "endDate": "2022-03-18",
            "summary": "I was involved in the development of several applications which offered insurance companies an automation of the reinsurance workflow through a private permissioned blockchain called Corda. Contributed to structuring and orchestration the frontend side of the application, adding good practice patterns such as Redux and reusable component library using Storybook. Managed the orchestration and architecture of complex logic for a large number inter-fields calculations and validation.",
            "highlights": [
                "In addition to this, I contributed to a multi-party contract negotiation platform that featured fully segregated data multi-tenancy. My primary responsibilities included developing the frontend React application and contributing to the project's architecture.",
                "Furthermore, I assumed the role of Lead Coordinator within the company's internship programs, overseeing a team of mentors and spearheading the development of the training curriculum, thereby enhancing the professional growth and learning experience of the interns.",
                "Additionally, I created a roadmap creator and viewer for the company's training programs, enabling the display of graph-like roadmaps with links to markdown files hosted on Github."
            ]
        },
        {
            "name": "MSG Systems Romania",
            "position": "Junior Software Engineer",
            "url": "https://www.msg-systems.ro/",
            "startDate": "2019-09-20",
            "endDate": "2020-03-20",
            "summary": "Worked on an application for ticketing and promotions offered by energy companies in Germany. Contributed to the development of a full-stack application, employing Node.js (Express.js), GraphQL, Angular, Postgres, Redis and AWS, implementing features across all facets of the application, including E2E testing using Cypress.",
            "highlights": [
                "Furthermore, I served as a mentor within the company's internship program, providing guidance and training to interns to enhance their professional development."
            ]
        },
        {
            "name": "MSG Systems Romania",
            "position": "Summer Intern",
            "url": "https://www.msg-systems.ro/",
            "startDate": "2019-06-20",
            "endDate": "2019-09-20",
            "summary": "Worked and developed a full-stack project alongside a small team of fellow interns using Angular, Spring and a SAP backend.",
            "highlights": []
        },
        {
            "name": "Yardi Romania",
            "position": "Intern",
            "url": "https://careers.yardiromania.ro/",
            "startDate": "2018-10-01",
            "endDate": "2019-01-20",
            "summary": "Worked on as a web developer intern in an Agile project focusing of US real estate market.",
            "highlights": []
        }
    ],
    "volunteer": [],
    "education": [
        {
            "institution": "Technical University of Cluj-Napoca",
            "url": "https://www.utcluj.ro/",
            "area": "Information Technology in Economy",
            "studyType": "Master's Degree",
            "startDate": "2020-01-01",
            "endDate": "2023-09-20",
            "courses": []
        },
        {
            "institution": "Technical University of Cluj-Napoca",
            "url": "https://www.utcluj.ro/",
            "area": "Computer Science",
            "studyType": "Bachelor's degree",
            "startDate": "2016-01-01",
            "endDate": "2020-09-20",
            "courses": []
        },
        {
            "institution": "Ion Bratianu National College, Pitesti",
            "url": "https://colegiulbratianu.ro/",
            "area": "Intensive Mathematics-Informatics",
            "studyType": "Baccalaureate",
            "startDate": "2012-01-01",
            "endDate": "2016-09-20",
            "courses": []
        }
    ],
    "awards": [],
    "certificates": [
        {
            "name": "AWS Certified Developer – Associate",
            "date": "2024-05-30",
            "issuer": "Amazon Web Services Training and Certification",
            "url": "https://www.credly.com/badges/6217b40a-d8d9-4dae-aa1c-6a605db9e9f0/public_url"
        },
        {
            "name": "Corda Certified Developer",
            "date": "2020-03-17",
            "issuer": "R3",
            "url": "https://www.credly.com/badges/23b49756-5e7a-40dc-8bf5-3687f4ed1b6a/public_url"
        }
    ],
    "publications": [],
    "skills": [
        {
            "name": "Frontend",
            "keywords": [
                "Angular",
                "React",
                "HTML",
                "CSS",
                "SASS",
                "Tailwind",
                "Ngrx",
                "Redux",
                "Material Design",
                "Storybook"
            ]
        },
        {
            "name": "Languages",
            "keywords": ["TypeScript", "JavaScript", "Java", "Solidity"]
        },
        {
            "name": "Backend",
            "keywords": [
                "Terraform",
                "AWS CDK",
                "AWS Services",
                "Docker",
                "Github Actions",
                ""
            ]
        },
        {
            "name": "DevOps",
            "keywords": [
                "NodeJs",
                "SpringBoot",
                "AWS Lambda",
                "ExpressJs",
                "NestJs",
                "GraphQl",
                "PostgreSql",
                "DynamoDB",
                "JPA",
                "TypeORM"
            ]
        },
        {
            "name": "Testing",
            "keywords": ["Jest", "Cypress"]
        },
        {
            "name": "Miscellaneous",
            "keywords": ["Git", "Nx", "Esbuild", "Ethereum"]
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        }
    ],
    "interests": [],
    "references": [],
    "projects": []
}
